HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDsadc_reg.h
/** \\brief  818, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH7_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024818u)

/** Alias (User Manual Name) for DSADC_CH7_FCFGA.
* To use register names with standard convension, please use DSADC_CH7_FCFGA.
*/
#define	DSADC_FCFGA7	(DSADC_CH7_FCFGA)

/** \\brief  814, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH7_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024814u)

/** Alias (User Manual Name) for DSADC_CH7_FCFGC.
* To use register names with standard convension, please use DSADC_CH7_FCFGC.
*/
#define	DSADC_FCFGC7	(DSADC_CH7_FCFGC)

/** \\brief  810, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH7_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024810u)

/** Alias (User Manual Name) for DSADC_CH7_FCFGM.
* To use register names with standard convension, please use DSADC_CH7_FCFGM.
*/
#define	DSADC_FCFGM7	(DSADC_CH7_FCFGM)

/** \\brief  820, Integration Window Control Register */
#define DSADC_CH7_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024820u)

/** Alias (User Manual Name) for DSADC_CH7_IWCTR.
* To use register names with standard convension, please use DSADC_CH7_IWCTR.
*/
#define	DSADC_IWCTR7	(DSADC_CH7_IWCTR)

/** \\brief  800, Modulator Configuration Register */
#define DSADC_CH7_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024800u)

/** Alias (User Manual Name) for DSADC_CH7_MODCFG.
* To use register names with standard convension, please use DSADC_CH7_MODCFG.
*/
#define	DSADC_MODCFG7	(DSADC_CH7_MODCFG)

/** \\brief  838, Offset Register Main Filter */
#define DSADC_CH7_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024838u)

/** Alias (User Manual Name) for DSADC_CH7_OFFM.
* To use register names with standard convension, please use DSADC_CH7_OFFM.
*/
#define	DSADC_OFFM7	(DSADC_CH7_OFFM)

/** \\brief  8A8, Rectification Configuration Register */
#define DSADC_CH7_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00248A8u)

/** Alias (User Manual Name) for DSADC_CH7_RECTCFG.
* To use register names with standard convension, please use DSADC_CH7_RECTCFG.
*/
#define	DSADC_RECTCFG7	(DSADC_CH7_RECTCFG)

/** \\brief  840, Result Register Auxiliary Filter */
#define DSADC_CH7_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024840u)

/** Alias (User Manual Name) for DSADC_CH7_RESA.
* To use register names with standard convension, please use DSADC_CH7_RESA.
*/
#define	DSADC_RESA7	(DSADC_CH7_RESA)

/** \\brief  830, Result Register Main Filter */
#define DSADC_CH7_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024830u)

/** Alias (User Manual Name) for DSADC_CH7_RESM.
* To use register names with standard convension, please use DSADC_CH7_RESM.
*/
#define	DSADC_RESM7	(DSADC_CH7_RESM)

/** \\brief  850, Time-Stamp Register */
#define DSADC_CH7_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024850u)

/** Alias (User Manual Name) for DSADC_CH7_TSTMP.
* To use register names with standard convension, please use DSADC_CH7_TSTMP.
*/
#define	DSADC_TSTMP7	(DSADC_CH7_TSTMP)

/** \\brief  928, Boundary Select Register */
#define DSADC_CH8_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024928u)

/** Alias (User Manual Name) for DSADC_CH8_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH8_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL8	(DSADC_CH8_BOUNDSEL)

/** \\brief  9A0, Carrier Generator Synchronization Register */
#define DSADC_CH8_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF00249A0u)

/** Alias (User Manual Name) for DSADC_CH8_CGSYNC.
* To use register names with standard convension, please use DSADC_CH8_CGSYNC.
*/
#define	DSADC_CGSYNC8	(DSADC_CH8_CGSYNC)

/** \\brief  908, Demodulator Input Configuration Register */
#define DSADC_CH8_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024908u)

/** Alias (User Manual Name) for DSADC_CH8_DICFG.
* To use register names with standard convension, please use DSADC_CH8_DICFG.
*/
#define	DSADC_DICFG8	(DSADC_CH8_DICFG)

/** \\brief  918, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH8_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024918u)

/** Alias (User Manual Name) for DSADC_CH8_FCFGA.
* To use register names with standard convension, please use DSADC_CH8_FCFGA.
*/
#define	DSADC_FCFGA8	(DSADC_CH8_FCFGA)

/** \\brief  914, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH8_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024914u)

/** Alias (User Manual Name) for DSADC_CH8_FCFGC.
* To use register names with standard convension, please use DSADC_CH8_FCFGC.
*/
#define	DSADC_FCFGC8	(DSADC_CH8_FCFGC)

/** \\brief  910, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH8_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024910u)

/** Alias (User Manual Name) for DSADC_CH8_FCFGM.
* To use register names with standard convension, please use DSADC_CH8_FCFGM.
*/
#define	DSADC_FCFGM8	(DSADC_CH8_FCFGM)

/** \\brief  920, Integration Window Control Register */
#define DSADC_CH8_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024920u)

/** Alias (User Manual Name) for DSADC_CH8_IWCTR.
* To use register names with standard convension, please use DSADC_CH8_IWCTR.
*/
#define	DSADC_IWCTR8	(DSADC_CH8_IWCTR)

/** \\brief  900, Modulator Configuration Register */
#define DSADC_CH8_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024900u)

/** Alias (User Manual Name) for DSADC_CH8_MODCFG.
* To use register names with standard convension, please use DSADC_CH8_MODCFG.
*/
#define	DSADC_MODCFG8	(DSADC_CH8_MODCFG)

/** \\brief  938, Offset Register Main Filter */
#define DSADC_CH8_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024938u)

/** Alias (User Manual Name) for DSADC_CH8_OFFM.
* To use register names with standard convension, please use DSADC_CH8_OFFM.
*/
#define	DSADC_OFFM8	(DSADC_CH8_OFFM)

/** \\brief  9A8, Rectification Configuration Register */
#define DSADC_CH8_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00249A8u)

/** Alias (User Manual Name) for DSADC_CH8_RECTCFG.
* To use register names with standard convension, please use DSADC_CH8_RECTCFG.
*/
#define	DSADC_RECTCFG8	(DSADC_CH8_RECTCFG)

