HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDsadc_reg.h
/** \\brief  940, Result Register Auxiliary Filter */
#define DSADC_CH8_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024940u)

/** Alias (User Manual Name) for DSADC_CH8_RESA.
* To use register names with standard convension, please use DSADC_CH8_RESA.
*/
#define	DSADC_RESA8	(DSADC_CH8_RESA)

/** \\brief  930, Result Register Main Filter */
#define DSADC_CH8_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024930u)

/** Alias (User Manual Name) for DSADC_CH8_RESM.
* To use register names with standard convension, please use DSADC_CH8_RESM.
*/
#define	DSADC_RESM8	(DSADC_CH8_RESM)

/** \\brief  950, Time-Stamp Register */
#define DSADC_CH8_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024950u)

/** Alias (User Manual Name) for DSADC_CH8_TSTMP.
* To use register names with standard convension, please use DSADC_CH8_TSTMP.
*/
#define	DSADC_TSTMP8	(DSADC_CH8_TSTMP)

/** \\brief  A28, Boundary Select Register */
#define DSADC_CH9_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024A28u)

/** Alias (User Manual Name) for DSADC_CH9_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH9_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL9	(DSADC_CH9_BOUNDSEL)

/** \\brief  AA0, Carrier Generator Synchronization Register */
#define DSADC_CH9_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF0024AA0u)

/** Alias (User Manual Name) for DSADC_CH9_CGSYNC.
* To use register names with standard convension, please use DSADC_CH9_CGSYNC.
*/
#define	DSADC_CGSYNC9	(DSADC_CH9_CGSYNC)

/** \\brief  A08, Demodulator Input Configuration Register */
#define DSADC_CH9_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024A08u)

/** Alias (User Manual Name) for DSADC_CH9_DICFG.
* To use register names with standard convension, please use DSADC_CH9_DICFG.
*/
#define	DSADC_DICFG9	(DSADC_CH9_DICFG)

/** \\brief  A18, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH9_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024A18u)

/** Alias (User Manual Name) for DSADC_CH9_FCFGA.
* To use register names with standard convension, please use DSADC_CH9_FCFGA.
*/
#define	DSADC_FCFGA9	(DSADC_CH9_FCFGA)

/** \\brief  A14, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH9_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024A14u)

/** Alias (User Manual Name) for DSADC_CH9_FCFGC.
* To use register names with standard convension, please use DSADC_CH9_FCFGC.
*/
#define	DSADC_FCFGC9	(DSADC_CH9_FCFGC)

/** \\brief  A10, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH9_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024A10u)

/** Alias (User Manual Name) for DSADC_CH9_FCFGM.
* To use register names with standard convension, please use DSADC_CH9_FCFGM.
*/
#define	DSADC_FCFGM9	(DSADC_CH9_FCFGM)

/** \\brief  A20, Integration Window Control Register */
#define DSADC_CH9_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024A20u)

/** Alias (User Manual Name) for DSADC_CH9_IWCTR.
* To use register names with standard convension, please use DSADC_CH9_IWCTR.
*/
#define	DSADC_IWCTR9	(DSADC_CH9_IWCTR)

/** \\brief  A00, Modulator Configuration Register */
#define DSADC_CH9_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024A00u)

/** Alias (User Manual Name) for DSADC_CH9_MODCFG.
* To use register names with standard convension, please use DSADC_CH9_MODCFG.
*/
#define	DSADC_MODCFG9	(DSADC_CH9_MODCFG)

/** \\brief  A38, Offset Register Main Filter */
#define DSADC_CH9_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024A38u)

/** Alias (User Manual Name) for DSADC_CH9_OFFM.
* To use register names with standard convension, please use DSADC_CH9_OFFM.
*/
#define	DSADC_OFFM9	(DSADC_CH9_OFFM)

/** \\brief  AA8, Rectification Configuration Register */
#define DSADC_CH9_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF0024AA8u)

/** Alias (User Manual Name) for DSADC_CH9_RECTCFG.
* To use register names with standard convension, please use DSADC_CH9_RECTCFG.
*/
#define	DSADC_RECTCFG9	(DSADC_CH9_RECTCFG)

/** \\brief  A40, Result Register Auxiliary Filter */
#define DSADC_CH9_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024A40u)

/** Alias (User Manual Name) for DSADC_CH9_RESA.
* To use register names with standard convension, please use DSADC_CH9_RESA.
*/
#define	DSADC_RESA9	(DSADC_CH9_RESA)

/** \\brief  A30, Result Register Main Filter */
#define DSADC_CH9_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024A30u)

/** Alias (User Manual Name) for DSADC_CH9_RESM.
* To use register names with standard convension, please use DSADC_CH9_RESM.
*/
#define	DSADC_RESM9	(DSADC_CH9_RESM)

/** \\brief  A50, Time-Stamp Register */
#define DSADC_CH9_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024A50u)

/** Alias (User Manual Name) for DSADC_CH9_TSTMP.
* To use register names with standard convension, please use DSADC_CH9_TSTMP.
*/
#define	DSADC_TSTMP9	(DSADC_CH9_TSTMP)

/** \\brief  0, Clock Control Register */
#define DSADC_CLC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CLC*)0xF0024000u)

/** \\brief  E0, Event Flag Register */
#define DSADC_EVFLAG /*lint --e(923)*/ (*(volatile Ifx_DSADC_EVFLAG*)0xF00240E0u)

/** \\brief  E4, Event Flag Clear Register */
#define DSADC_EVFLAGCLR /*lint --e(923)*/ (*(volatile Ifx_DSADC_EVFLAGCLR*)0xF00240E4u)

/** \\brief  80, Global Configuration Register */
#define DSADC_GLOBCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_GLOBCFG*)0xF0024080u)

/** \\brief  88, Global Run Control Register */
#define DSADC_GLOBRC /*lint --e(923)*/ (*(volatile Ifx_DSADC_GLOBRC*)0xF0024088u)

/** \\brief  B0, Common Mode Hold Voltage Register 0 */
#define DSADC_GLOBVCMH0 /*lint --e(923)*/ (*(volatile Ifx_DSADC_GLOBVCMH0*)0xF00240B0u)

/** \\brief  B4, Common Mode Hold Voltage Register 1 */
#define DSADC_GLOBVCMH1 /*lint --e(923)*/ (*(volatile Ifx_DSADC_GLOBVCMH1*)0xF00240B4u)

/** \\brief  B8, Common Mode Hold Voltage Register 2 */
#define DSADC_GLOBVCMH2 /*lint --e(923)*/ (*(volatile Ifx_DSADC_GLOBVCMH2*)0xF00240B8u)

/** \\brief  8, Module Identification Register */
#define DSADC_ID /*lint --e(923)*/ (*(volatile Ifx_DSADC_ID*)0xF0024008u)

/** \\brief  34, Kernel Reset Register 0 */
#define DSADC_KRST0 /*lint --e(923)*/ (*(volatile Ifx_DSADC_KRST0*)0xF0024034u)

/** \\brief  30, Kernel Reset Register 1 */
#define DSADC_KRST1 /*lint --e(923)*/ (*(volatile Ifx_DSADC_KRST1*)0xF0024030u)

/** \\brief  2C, Kernel Reset Status Clear Register */
#define DSADC_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_DSADC_KRSTCLR*)0xF002402Cu)

/** \\brief  28, OCDS Control and Status Register */
#define DSADC_OCS /*lint --e(923)*/ (*(volatile Ifx_DSADC_OCS*)0xF0024028u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDSADC_REG_H */
